export const serverList = {
   anton: "안톤", bakal: "바칼", cain: "카인", casillas: "카시야스", diregie: "디레지에", hilder: "힐더", prey: "프레이", siroco: "시로코"
}
export const apiURL = process.env.REACT_APP_API_URL
export function navi_chaeck(fame, checkFame1, checkFame2) {
   if (fame === checkFame1) {
      return "종결"
   } else if (fame < checkFame1 && fame >= checkFame2) {
      return "준종결"
   } else {
      return "통수"
   }
}
export const spChars = [
   { "직업": "眞 다크템플러", "레벨": 11 },
   { "직업": "眞 스트라이커", "레벨": 30 },
   { "직업": "眞 엘레멘탈 바머", "레벨": 30 },
   { "직업": "眞 스위프트 마스터", "레벨": 30 },
   { "직업": "眞 엘레멘탈마스터", "레벨": 25 },
   { "직업": "眞 배틀메이지", "레벨": 11 },
   { "직업": "眞 크루세이더", "레벨": 30 },
   { "직업": "眞 어벤저", "레벨": 30 },
   { "직업": "眞 무녀", "레벨": 30 },
   { "직업": "眞 엘븐나이트", "레벨": 30 }
]
export const not100Chars = [
   {"직업":"眞 버서커","만크":77.6},
   {"직업":"眞 아수라","만크":80},
   {"직업":"眞 스트리트파이터","만크":60},
   {"직업":"眞 레인저","만크":72.6},
   {"직업":"眞 디멘션 워커","만크":82.5},
   {"직업":"眞 엘레멘탈마스터","만크":93.8},
   {"직업":"眞 배틀메이지","만크":49.1},
   {"직업":"眞 크루세이더","만크":70},
   {"직업":"眞 인파이터","만크":78.5},
   {"직업":"眞 퇴마사","만크":62},
   {"직업":"眞 이단심판관","만크":80},
   {"직업":"眞 미스트리스","만크":75.5},
   {"직업":"眞 로그","만크":50},
   {"직업":"眞 섀도우 댄서","만크":69.1},
   {"직업":"眞 팔라딘","만크":69.5},
   {"직업":"眞 뱅가드","만크":70},
   {"직업":"眞 다크 랜서","만크":80},
   {"직업":"眞 스페셜리스트","만크":80},
   {"직업":"眞 트래블러","만크":78},
   {"직업":"眞 크리에이터","만크":80}
]

export function critical(pCri, mCri) {
   if (pCri < mCri) {
      return mCri
   } else if (pCri > mCri) {
      return pCri
   } else {
      return mCri
   }
}